# InitialWattageIntensity Properties

---
The InitialWattageIntensity type exposes the following members.
| Name| Description
---|---|---
| Efficacy|  The efficacy value.
| InitialIntensityValue|  The calculated initial intensity value. (Inherited from InitialIntensity)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialIntensity)
| Wattage|  The wattage value.
Top
#### Reference
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace